goal_setter/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def index
    @user = User.find_by(session_token: session[:session_token])